insert into homeowners.building (address) values ('г. Самара, ул. Аэродромная, 59, 61');

insert into apartment_type (id, name) values
    (1, 'Квартира'),
    (2, 'Паркинг'),
    (3, 'Коммерческая площадь');

insert into ownership_type (id, name) values
    (1, 'Единоличная собственность'),
    (2, 'Совместная собственность'),
    (3, 'Долевая собственность'),
    (4, 'Не собственник');

insert into homeowners.apartment_user (full_name, short_name)
    values
    ('Сергей Петрович Кашин', 'Сергей'),
    ('Серёга', 'Сергей'),
    ('Иван Дементьев', 'Вано'),
    ('Павел Иванов', 'Пашка'),
    ('Серёжа Анатольевич', 'Сергей'),
    ('Петров Пётр Петрович', 'Петров Пётр'),
    ('Иванов Иван Иванович', 'Иванов Иван'),
    ('Иванова Марфа Евгеньевна', 'Иванова Марфа'),
    ('Сергеев Сергей Сергеевич', 'Сергеев Сергей'),
    ('Сергеева Анна Николаевна', 'Сергеева Анна'),
    ('Антонов Антон Антонович', 'Антонов Антон'),
    ('Антонова Юлия Валерьевна', 'Антонова Юлия');

insert into apartment (building_id, apartment_type_id, number, floor, square) values
    (1, 1, 1, 1, 50),
    (1, 1, 2, 1, 100),
    (1, 1, 3, 1, 70),
    (1, 1, 4, 1, 80),
    (1, 1, 5, 1, 100),
    (1, 1, 6, 1, 50),
    (1, 1, 7, 2, 50),
    (1, 1, 8, 2, 100),
    (1, 1, 9,  2, 70),
    (1, 1, 10, 2, 80),
    (1, 1, 11, 2, 100),
    (1, 1, 12, 2, 50),
    (1, 1, 13, 3, 50),
    (1, 1, 14, 3, 100),
    (1, 1, 15, 3, 70),
    (1, 1, 16, 3, 80),
    (1, 1, 17, 3, 100),
    (1, 1, 18, 3, 50),
    (1, 1, 19, 4, 50),
    (1, 1, 20, 4, 100),
    (1, 1, 21, 4, 70),
    (1, 1, 22, 4, 80),
    (1, 1, 23, 4, 100),
    (1, 1, 24, 4, 50);

insert into ownership (apartment_id, user_id, ownership_type_id, share) values
    (1,  1, 1, 1),
    (3,  1, 1, 1),
    (5,  2, 2, 1),
    (5,  4, 3, 0.7),
    (10, 5, 3, 0.3),
    (11, 6, 4, 0),
    (11, 7, 4, 0);

insert into voting.voting (building_id, author_id, start_date, end_date, description) values
    (1, 1, now(), now() + '1 month'::interval, 'Голосование о том, о сём.');

insert into voting.voting_topic (voting_id, title, content) values
    (1, 'Выбрать председателя собрания.', 'Выбрать председателя собрания Сергей Сергеева из 1-й квартиры'),
    (1, 'Выбрать совет дома.', 'Выбрать в совет дома Сергея из 3-й квартиры и Павла из 5-й'),
    (1, 'Выбрать управляющую компанию', 'Выбрать управляющей компанией ООО "Чистый дом"');

insert into voting.voting_vote (voting_id, topic_id, voter_id, value) values
    (1, 1,  1, 'for'),
    (1, 1,  2, 'for'),
    (1, 1,  3, 'against'),
    (1, 1,  4, 'forgo'),
    (1, 1,  5, 'for'),
    (1, 1,  6, 'for'),
    (1, 1,  7, 'for'),
    (1, 2,  1, 'forgo'),
    (1, 2,  2, 'against'),
    (1, 2,  3, 'against'),
    (1, 2,  4, 'forgo'),
    (1, 2,  5, 'for'),
    (1, 2,  6, 'forgo'),
    (1, 2,  7, 'for'),
    (1, 3,  1, 'forgo'),
    (1, 3,  2, 'for'),
    (1, 3,  3, 'for'),
    (1, 3,  4, 'forgo'),
    (1, 3,  5, 'against'),
    (1, 3,  6, 'forgo'),
    (1, 3,  7, 'for');

